rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "app_threadx.h"
#include "app_camera_buffers.h"
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include "debug_console.h"
#include "debug_led.h"
#include "i2c_scanner.h"
#include "ina219_power.h"
#include "inference_metrics.h"
#include "stm32n6xx_hal_cortex.h"
#include "threadx_utils.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define APP_LED_ONLY_SMOKE_TEST 0

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

__IO uint32_t BspButtonState = BUTTON_RELEASED;

DCMIPP_HandleTypeDef hdcmipp;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

UART_HandleTypeDef hlpuart1;

SPI_HandleTypeDef hspi5;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void MX_GPIO_Init(void);
static void MX_LPUART1_UART_Init(void);
static void MX_SPI5_Init(void);
static void MX_DCMIPP_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void SystemIsolation_Config(void);
/* USER CODE BEGIN PFP */
void App_SystemClock_Config(void);
void App_CameraKernelClock_Config(void);
static void Setup_Mpu(void);
static bool App_Ethernet_PhyPowerDown(void);
extern uint32_t __snoncacheable;
extern uint32_t __enoncacheable;

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* The Nucleo board's LAN8742A is powered continuously from VDD3V3 and its
 * reset input is tied to the MCU's global NRST.  Since this application does
 * not use Ethernet, the PHY's MDIO general power-down bit is the only
 * firmware-controlled way to stop its analog/link circuitry without resetting
 * the whole MCU. */
#define APP_ETH_PHY_BCR 0U
#define APP_ETH_PHY_ID1 2U
#define APP_ETH_PHY_ID2 3U
#define APP_ETH_PHY_POWER_DOWN 0x0800U
#define APP_ETH_PHY_LAN8742_ID1 0x0007U
#define APP_ETH_PHY_LAN8742_ID2 0xC130U
#define APP_ETH_MDIO_TIMEOUT_MS 1000U

/**
 * @brief Wait until the ETH1 MDIO engine is idle.
 * @param timeout_ms Maximum wait time in milliseconds.
 * @retval true when the engine became idle; false on timeout.
 * @sideeffects Reads ETH1 MAC MDIO status and consumes no RTOS resources.
 */
static bool App_Eth1_MdioWaitIdle(uint32_t timeout_ms) {
	const uint32_t tick_start = HAL_GetTick();

	while ((ETH1->MACMDIOAR & ETH_MACMDIOAR_GB) != 0U) {
		if ((HAL_GetTick() - tick_start) > timeout_ms) {
			return false;
		}
	}
	return true;
}

/**
 * @brief Select an MDIO clock divider valid for the current HCLK frequency.
 * @retval None.
 * @sideeffects Updates only the ETH1 MAC MDIO clock-range field.
 */
static void App_Eth1_MdioConfigureClock(void) {
	const uint32_t hclk_hz = HAL_RCC_GetHCLKFreq();
	uint32_t mdio_address = ETH1->MACMDIOAR & ~ETH_MACMDIOAR_CR;

	/* why: MDC must remain within the LAN8742A management-interface limit even
	 * though the rest of the Ethernet MAC is never started. */
	if (hclk_hz < 35000000U) {
		mdio_address |= ETH_MACMDIOAR_CR_DIV16;
	} else if (hclk_hz < 60000000U) {
		mdio_address |= ETH_MACMDIOAR_CR_DIV26;
	} else if (hclk_hz < 100000000U) {
		mdio_address |= ETH_MACMDIOAR_CR_DIV42;
	} else if (hclk_hz < 150000000U) {
		mdio_address |= ETH_MACMDIOAR_CR_DIV62;
	} else if (hclk_hz < 250000000U) {
		mdio_address |= ETH_MACMDIOAR_CR_DIV102;
	} else if (hclk_hz < 300000000U) {
		mdio_address |= ETH_MACMDIOAR_CR_DIV124;
	} else if (hclk_hz < 500000000U) {
		mdio_address |= ETH_MACMDIOAR_CR_DIV204;
	} else {
		mdio_address |= ETH_MACMDIOAR_CR_DIV324;
	}
	ETH1->MACMDIOAR = mdio_address;
}

/**
 * @brief Read one Clause-22 register from an Ethernet PHY.
 * @param phy_address PHY management address, 0 through 31.
 * @param phy_register PHY register address, 0 through 31.
 * @param value Destination for the 16-bit register value.
 * @retval true when the transaction completed; false on timeout or busy state.
 * @sideeffects Generates one MDIO read transaction on ETH1.
 */
static bool App_Eth1_MdioRead(uint32_t phy_address, uint32_t phy_register,
		uint16_t *value) {
	uint32_t mdio_address;

	if (value == NULL || !App_Eth1_MdioWaitIdle(APP_ETH_MDIO_TIMEOUT_MS)) {
		return false;
	}

	mdio_address = ETH1->MACMDIOAR;
	MODIFY_REG(mdio_address, ETH_MACMDIOAR_PA,
			(phy_address << ETH_MACMDIOAR_PA_Pos));
	MODIFY_REG(mdio_address, ETH_MACMDIOAR_RDA,
			(phy_register << ETH_MACMDIOAR_RDA_Pos));
	/* Clause-22 read: GOC[1:0] = 11, matching STM32N6 HAL ETH. */
	MODIFY_REG(mdio_address, ETH_MACMDIOAR_GOC,
			ETH_MACMDIOAR_GOC_1 | ETH_MACMDIOAR_GOC_0);
	SET_BIT(mdio_address, ETH_MACMDIOAR_GB);
	ETH1->MACMDIOAR = mdio_address;

	if (!App_Eth1_MdioWaitIdle(APP_ETH_MDIO_TIMEOUT_MS)) {
		return false;
	}
	*value = (uint16_t) ETH1->MACMDIODR;
	return true;
}

/**
 * @brief Write one Clause-22 register on an Ethernet PHY.
 * @param phy_address PHY management address, 0 through 31.
 * @param phy_register PHY register address, 0 through 31.
 * @param value 16-bit register value to write.
 * @retval true when the transaction completed; false on timeout or busy state.
 * @sideeffects Generates one MDIO write transaction on ETH1.
 */
static bool App_Eth1_MdioWrite(uint32_t phy_address, uint32_t phy_register,
		uint16_t value) {
	uint32_t mdio_address;

