rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/main.c
	if (!App_Eth1_MdioWaitIdle(APP_ETH_MDIO_TIMEOUT_MS)) {
		return false;
	}

	mdio_address = ETH1->MACMDIOAR;
	MODIFY_REG(mdio_address, ETH_MACMDIOAR_PA,
			(phy_address << ETH_MACMDIOAR_PA_Pos));
	MODIFY_REG(mdio_address, ETH_MACMDIOAR_RDA,
			(phy_register << ETH_MACMDIOAR_RDA_Pos));
	/* Clause-22 write: GOC[1:0] = 01, matching STM32N6 HAL ETH. */
	MODIFY_REG(mdio_address, ETH_MACMDIOAR_GOC, ETH_MACMDIOAR_GOC_0);
	ETH1->MACMDIODR = value;
	SET_BIT(mdio_address, ETH_MACMDIOAR_GB);
	ETH1->MACMDIOAR = mdio_address;

	return App_Eth1_MdioWaitIdle(APP_ETH_MDIO_TIMEOUT_MS);
}

/**
 * @brief Put the on-board LAN8742A Ethernet PHY into general power-down.
 * @retval true when the LAN8742A was found and verified in power-down.
 * @sideeffects Temporarily enables ETH1 management clocks and RMII management
 *              pins, writes PHY BCR bit 11, then deinitializes those pins and
 *              gates the ETH1 clocks. Ethernet remains unavailable thereafter.
 */
static bool App_Ethernet_PhyPowerDown(void) {
	GPIO_InitTypeDef gpio_init = { 0 };
	uint32_t phy_address = 0U;
	uint16_t phy_id1 = 0U;
	uint16_t phy_id2 = 0U;
	uint16_t basic_control = 0U;
	bool phy_found = false;
	bool power_down_ok = false;

	/* The application never initializes ETH1. Bring up only its management
	 * path, not DMA or packet reception, for this one-time PHY command. */
	MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_ETH1CLKSEL,
			RCC_ETH1CLKSOURCE_HCLK);
	SET_BIT(RCC->CCIPR2, RCC_ETH1PHYIF_RMII);
	__HAL_RCC_ETH1_CLK_ENABLE();
	__HAL_RCC_ETH1MAC_CLK_ENABLE();
	__HAL_RCC_ETH1TX_CLK_ENABLE();
	__HAL_RCC_ETH1RX_CLK_ENABLE();
	App_Eth1_MdioConfigureClock();

	__HAL_RCC_GPIOF_CLK_ENABLE();
	__HAL_RCC_GPIOG_CLK_ENABLE();
	gpio_init.Mode = GPIO_MODE_AF_PP;
	gpio_init.Pull = GPIO_NOPULL;
	gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
	gpio_init.Alternate = GPIO_AF11_ETH1;
	gpio_init.Pin = GPIO_PIN_4;
	HAL_GPIO_Init(GPIOF, &gpio_init);
	gpio_init.Pin = GPIO_PIN_11;
	HAL_GPIO_Init(GPIOG, &gpio_init);

	/* The board straps PHYAD0 low, but scan the management addresses so a
	 * board-revision strap difference cannot cause a write to the wrong device. */
	for (phy_address = 0U; phy_address < 32U; ++phy_address) {
		if (!App_Eth1_MdioRead(phy_address, APP_ETH_PHY_ID1, &phy_id1)
				|| !App_Eth1_MdioRead(phy_address, APP_ETH_PHY_ID2, &phy_id2)) {
			continue;
		}
		if (phy_id1 == APP_ETH_PHY_LAN8742_ID1
				&& (phy_id2 & 0xFFF0U) == APP_ETH_PHY_LAN8742_ID2) {
			phy_found = true;
			break;
		}
	}

	if (phy_found
			&& App_Eth1_MdioRead(phy_address, APP_ETH_PHY_BCR,
					&basic_control)
			&& App_Eth1_MdioWrite(phy_address, APP_ETH_PHY_BCR,
					(uint16_t) (basic_control | APP_ETH_PHY_POWER_DOWN))
			&& App_Eth1_MdioRead(phy_address, APP_ETH_PHY_BCR,
					&basic_control)) {
		power_down_ok = (basic_control & APP_ETH_PHY_POWER_DOWN) != 0U;
	}

	/* The management pins have no application owner. Returning them to their
	 * reset state avoids leaving high-speed alternate-function inputs active. */
	HAL_GPIO_DeInit(GPIOF, GPIO_PIN_4);
	HAL_GPIO_DeInit(GPIOG, GPIO_PIN_11);
	__HAL_RCC_ETH1RX_CLK_DISABLE();
	__HAL_RCC_ETH1TX_CLK_DISABLE();
	__HAL_RCC_ETH1MAC_CLK_DISABLE();
	__HAL_RCC_ETH1_CLK_DISABLE();
	__HAL_RCC_ETH1RX_CLK_SLEEP_DISABLE();
	__HAL_RCC_ETH1TX_CLK_SLEEP_DISABLE();
	__HAL_RCC_ETH1MAC_CLK_SLEEP_DISABLE();
	__HAL_RCC_ETH1_CLK_SLEEP_DISABLE();

	if (power_down_ok) {
		DebugConsole_Printf(
				"[ETH][PHY] LAN8742A addr=%lu ID=0x%04X%04X powered down.\r\n",
				(unsigned long) phy_address, (unsigned int) phy_id1,
				(unsigned int) phy_id2);
	} else {
		DebugConsole_Printf(
				"[ETH][PHY] LAN8742A power-down command failed; leaving board unchanged.\r\n");
	}
	return power_down_ok;
}

int __io_putchar(int ch) {
	/* The application log transport is DebugConsole.  The linked ISP
	 * middleware also uses libc printf/puts, and retargeting that stream to
	 * LPUART1 allows unframed middleware data to appear on the board console.
	 * Keep this hook consumed so only explicit DebugConsole messages reach the
	 * UART; this does not affect the camera, AI, or FileX data paths. */
	(void) ch;
	return ch;
}

/**
 * @brief Log the MCU reset source flags before clearing them.
 *
 * This helps distinguish a hard fault, watchdog reset, brown-out, or pin reset
 * when the board appears to reboot during scalar preprocessing.
 */
static void App_LogResetCause(void) {
	char line[192] = { 0 };
	const unsigned int pin =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST) != RESET) ? 1U : 0U;
	const unsigned int por =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_PORRST) != RESET) ? 1U : 0U;
	const unsigned int bor =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_BORRST) != RESET) ? 1U : 0U;
	const unsigned int sft =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST) != RESET) ? 1U : 0U;
	const unsigned int iwdg =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST) != RESET) ? 1U : 0U;
	const unsigned int wwdg =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST) != RESET) ? 1U : 0U;
	const unsigned int lck =
			(__HAL_RCC_GET_FLAG(RCC_FLAG_LCKRST) != RESET) ? 1U : 0U;

	(void) snprintf(line, sizeof(line),
			"[BOOT] Reset cause flags: PIN=%u POR=%u BOR=%u SFT=%u IWDG=%u WWDG=%u LCK=%u\r\n",
			pin, por, bor, sft, iwdg, wwdg, lck);
	DebugConsole_WriteString(line);
	__HAL_RCC_CLEAR_RESET_FLAGS();
}

/**
 * @brief Configure the application clock tree for camera capture.
 *
 * The generated application project did not include a SystemClock_Config()
 * routine, so the secure app inherited a 64 MHz fallback clock tree.
 * The camera path needs the same PLL1/PLL4 setup used by the working FSBL
 * reference clock tree.
 */
void App_SystemClock_Config(void) {
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

	if (HAL_PWREx_ConfigSupply(PWR_EXTERNAL_SOURCE_SUPPLY) != HAL_OK) {
		Error_Handler();
	}

	if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1)
			!= HAL_OK) {
		Error_Handler();
	}

	/* Keep HSI available while the PLL-backed system clock is reconfigured. */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

