rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/main.c
	/** Configure Digital filter */
	if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK) {
		Error_Handler();
	}
	/* USER CODE BEGIN I2C1_Init 2 */

	/* USER CODE END I2C1_Init 2 */
}

/**
 * @brief I2C2 Initialization Function
 * @param None
 * @retval None
 */
static void MX_I2C2_Init(void) {

	/* USER CODE BEGIN I2C2_Init 0 */

	/* USER CODE END I2C2_Init 0 */

	/* USER CODE BEGIN I2C2_Init 1 */

	/* USER CODE END I2C2_Init 1 */
	hi2c2.Instance = I2C2;
	hi2c2.Init.Timing = 0x009034B6;
	hi2c2.Init.OwnAddress1 = 0;
	hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
	hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
	hi2c2.Init.OwnAddress2 = 0;
	hi2c2.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
	hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
	hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
	if (HAL_I2C_Init(&hi2c2) != HAL_OK) {
		Error_Handler();
	}

	/** Configure Analogue filter
	 */
	if (HAL_I2CEx_ConfigAnalogFilter(&hi2c2, I2C_ANALOGFILTER_ENABLE)
			!= HAL_OK) {
		Error_Handler();
	}

	/** Configure Digital filter
	 */
	if (HAL_I2CEx_ConfigDigitalFilter(&hi2c2, 0) != HAL_OK) {
		Error_Handler();
	}
	/* USER CODE BEGIN I2C2_Init 2 */

	/* USER CODE END I2C2_Init 2 */
}

/**
 * @brief LPUART1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_LPUART1_UART_Init(void) {

	/* USER CODE BEGIN LPUART1_Init 0 */

	/* USER CODE END LPUART1_Init 0 */

	/* USER CODE BEGIN LPUART1_Init 1 */

	/* USER CODE END LPUART1_Init 1 */
	hlpuart1.Instance = LPUART1;
	hlpuart1.Init.BaudRate = 115200;
	hlpuart1.Init.WordLength = UART_WORDLENGTH_8B;
	hlpuart1.Init.StopBits = UART_STOPBITS_1;
	hlpuart1.Init.Parity = UART_PARITY_NONE;
	hlpuart1.Init.Mode = UART_MODE_TX_RX;
	hlpuart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	hlpuart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
	hlpuart1.Init.ClockPrescaler = UART_PRESCALER_DIV1;
	hlpuart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
	hlpuart1.FifoMode = UART_FIFOMODE_DISABLE;
	if (HAL_UART_Init(&hlpuart1) != HAL_OK) {
		Error_Handler();
	}
	if (HAL_UARTEx_SetTxFifoThreshold(&hlpuart1, UART_TXFIFO_THRESHOLD_1_8)
			!= HAL_OK) {
		Error_Handler();
	}
	if (HAL_UARTEx_SetRxFifoThreshold(&hlpuart1, UART_RXFIFO_THRESHOLD_1_8)
			!= HAL_OK) {
		Error_Handler();
	}
	if (HAL_UARTEx_DisableFifoMode(&hlpuart1) != HAL_OK) {
		Error_Handler();
	}
	/* USER CODE BEGIN LPUART1_Init 2 */

	/* USER CODE END LPUART1_Init 2 */
}

/**
 * @brief RIF Initialization Function
 * @param None
 * @retval None
 */
static void SystemIsolation_Config(void) {

	/* USER CODE BEGIN RIF_Init 0 */

	/* USER CODE END RIF_Init 0 */

	/* set all required IPs as secure privileged */
	__HAL_RCC_RIFSC_CLK_ENABLE();
	/* RISAF (memory region access filter) needs its own AHB3 clock. Without
	 * this, writes to RISAF2_S->REG[0].CFGR are silently dropped. */
	__HAL_RCC_RISAF_CLK_ENABLE();

	/*RIMC configuration*/
	RIMC_MasterConfig_t dcmipp_master = { 0 };
	RIMC_MasterConfig_t eth1_master = { 0 };

	dcmipp_master.MasterCID = RIF_CID_1;
	/* The ST forum fix for the N6 raw-dump/HPDMA symptom configures DCMIPP as
	 * secure and privileged on both the master and slave sides. We mirror that
	 * here so Pipe0 follows the same isolation model as the known-good setup. */
	dcmipp_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;
	HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DCMIPP,
			&dcmipp_master);
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DCMIPP,
	RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);

	eth1_master.MasterCID = RIF_CID_1;
	eth1_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_NPRIV;
	HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_ETH1, &eth1_master);

	/* RIF-Aware IPs Config */

	/* set up GPIO configuration */
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_0,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_3,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_5,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_7,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_10,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_11,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_0,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_3,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_6,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_7,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_10,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_11,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOD, GPIO_PIN_2,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOD, GPIO_PIN_10,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_3,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_5,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_6,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_15,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOG, GPIO_PIN_1,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOG, GPIO_PIN_2,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPION, GPIO_PIN_7,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);
	HAL_GPIO_ConfigPinAttributes(GPIOO, GPIO_PIN_5,
	GPIO_PIN_SEC | GPIO_PIN_NPRIV);

	/* USER CODE BEGIN RIF_Init 1 */

	/* Disable all RIF security on AXISRAM1/2 so any master (including DCMIPP,
	 * whose AXI transactions arrive non-secure regardless of RIMC config) can
	 * read and write freely. RISC: non-secure, non-privileged. RISAF: BREN=0
	 * (filter disabled — all accesses pass through). */
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_AXISRAM1,
	RIF_ATTRIBUTE_NPRIV);
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_AXISRAM2,
	RIF_ATTRIBUTE_NPRIV);

	{
		volatile uint32_t r1_cfgr;
		volatile uint32_t r2_cfgr;
		volatile uint32_t r2_cidcfgr;
		volatile uint32_t r2_startr;
		volatile uint32_t r2_endr;
		volatile uint32_t r3_cfgr;
		volatile uint32_t r3_cidcfgr;

		/* RISAF1 guards SRAM1 NS alias — disable the filter (belt-and-suspenders). */
		RISAF1_NS->REG[0].STARTR = 0x00000000U;
		RISAF1_NS->REG[0].ENDR = 0x000FFFFFU;
		RISAF1_NS->REG[0].CIDCFGR = 0x00000000U;
		RISAF1_NS->REG[0].CFGR = 0x00000000U; /* BREN=0, SEC=0 — no filtering */
		RISAF1_NS->IACR = 0xFFFFFFFFU; /* clear any stale illegal-access flags */

		/* RISAF2 guards the AXISRAM1 secure alias — disable filters so DCMIPP
		 * (MSEC=1) can write to the capture buffer even when we move it to the
		 * non-secure alias for this A/B test. */
		RISAF2_S->REG[0].STARTR = 0x00000000U;
		RISAF2_S->REG[0].ENDR = 0x000FFFFFU;
		RISAF2_S->REG[0].CIDCFGR = 0x00000000U;
		RISAF2_S->REG[0].CFGR = 0x00000000U; /* BREN=0 — no filtering */
		RISAF2_S->IACR = 0xFFFFFFFFU;
		RISAF2_NS->REG[0].STARTR = 0x00000000U;
		RISAF2_NS->REG[0].ENDR = 0x000FFFFFU;
		RISAF2_NS->REG[0].CIDCFGR = 0x00000000U;
		RISAF2_NS->REG[0].CFGR = 0x00000000U;
		RISAF2_NS->IACR = 0xFFFFFFFFU;

		/* RISAF3 guards AXISRAM2 — disable the filter */
		RISAF3_NS->REG[0].STARTR = 0x00000000U;
		RISAF3_NS->REG[0].ENDR = 0x000FFFFFU;
		RISAF3_NS->REG[0].CIDCFGR = 0x00000000U;
		RISAF3_NS->REG[0].CFGR = 0x00000000U; /* BREN=0, SEC=0 — no filtering */
		RISAF3_NS->IACR = 0xFFFFFFFFU; /* clear any stale illegal-access flags */

